{
    "create_plan": "créer un plan",
    "go_to_settings": "paramètres",
    "plan" : "le plan",
    "account" : "compte",
    "recipe" : "recette " ,
    "meal" : "repas" ,
    "preferences"  : "préférences",
    "reset_password" :  "changer mot de pass" ,
    "Change": "Modifier",
    "create_recipe" : "créer une recette"   ,
    "my_plans" : "Mes plans" ,
    "created_plans":"les plans créés" ,
    "searche_recipe " : "chercher une recette" ,
    "explore" : "Explore" ,
    "favorites" : "Favories" ,
    "created_recipes" : "recettes crées",
    "add" : "Ajouter" ,
    "recipes_selected" : "recettes selectionées",
    "selected_recipe": "recette selectionée",
    "add_meal":"Ajouter un repas" ,
    "plans": "plans" ,
    "Recipes":"recettes",
    "Servings": "Portions",
    "Ingredients": "Ingrédients",
    "Nutritive Facts": "Apports nutritionnels",
    "Directions": "Directions",
    "Step by step mode": "Mode pas à pas",
    "An error occured": "Une erreur s'est produite",
    "Error": "Erreur",
    "cal": "cal",
    "Jan": "Jan",
    "Feb": "Fev",
    "Mar": "Mar",
    "April": "Avril",
    "May": "Mai",
    "Jun": "Jun",
    "July": "Juil",
    "Aug": "Août",
    "Sep": "Sep",
    "Oct": "Oct",
    "Nov": "Nov",
    "Dec": "Dec",
    "Enter plan name": "Entrez le nom du plan",
    "Follow this Plan?": " Suivez ce Plan?",
    "By confirming this action the grocery list will be replaced by a new one and your purchased ingredients will be lost.": "En confirmant cette action, la liste d'épicerie sera remplacée par une nouvelle et vos ingrédients achetés seront perdus.",
    "Cancel": "Annuler",
    "Confirm": "Confirmer",
    "Following":"Suivi",
    "Follow": "Suivre",
    "new meal": "nouveau repas",
    "Only this day": "Seulement ce jour",
    "add this meal to all days of this plan?": "Ajouter ce repas à tous les jours de ce plan ?",
    "By confirming this action this meal will added to all days of the current plan ": "En confirmant cette action, ce repas sera ajouté à tous les jours du plan actuel",
    "All days": "Tous les jours",
    "Step": "Pas",
    "Ingredients for this step": "Ingrédients pour cette étape",
    "Previous": "Précédent",
    "Next": "Suivant",
    "Finish": "c'est bon",
    "Cal": "Cal",
    "Remove this meal ?": "Supprimer ce repas ?",
    "By confirming this action this meal will be removed from the current plan ": "En confirmant cette action, ce repas sera supprimé du plan actuel ",
    "Remove": "Supprimer",
    "Error fetching recipes": "Erreur lors de la récupération des recettes",
    "Rename meal": "Renommer le repas",
    "Delete meal": "Supprimer le repas",
    "Share meal": "Partager le repas ",
    "Followed": "suivi",
    "error occured": "erreur est survenue",
    "Groceries": "Ingrédients",
    "items": "items",
    "Sort By": "Trier par",
    "Plan": "Plan",
    "Category": "Catégorie",
    "Purchased": "Acheté",
    "Clear All": "Tout effacer",
    "Welcome to the app that will change your life. ": "Bienvenue sur l'application qui va changer votre vie.",
    "Start the journey": "Commencez le voyage",
    "Create recipe": "Créer une recette",
    "recipe saved": "recette enregistrée",
    "recipe unsaved ": "recette non enregistrée",
    "Save": "Sauvegarder",
    "choose image from gallery": "choisir l'image de la galerie",
    "Take a photo": "Prendre une photo",
    "Delete image": "Supprimer l'image",
    "Choose image ": "Choisissez l'image",
    "Recipe name": "Nom de la recette",
    "Type": "Type",
    "Diet": "Régime",
    "Add Ingredient": "Ajouter un ingrédient",
    "Add step": "Ajouter un pas",
    "insert your step here": "insérer votre pas ici",
    "Body results": "Résultats corporels",
    "Readjust activities": "Réajuster les activités",
    "Looks good": "c'est bon",
    "Lying": "allongée",
    "Sitting": "assise",
    "Standing": "debout",
    "Moderate": "modérées",
    "High intensity": "haute intensité",
    "Intense": "intenses",
    "Your daily needs in calories : ": "Vos besoins quotidiens en calories : ",
    "Doing theses activies : ": "En faisant ces activités : ",
    "no object passed ": "aucun objet n'est passé",
    "Physical activity evaluation": "Évaluation de l'activité physique",
    "Let's calculate your body needs in calories. ": "Calculons les besoins de votre corps en calories.",
    "During the day how much time do you spend doing each of these activities?": "Pendant la journée, combien de temps consacrez-vous à chacune de ces activités ?",
    "Please Be specific and honest to get the right estimations.": "Veuillez être précis et honnête pour obtenir les bonnes estimations.",
    "If you don't do an activity leave at 0 hours.": "Si vous ne faites pas d'activité partez à 0 heures.",
    "sum activities": "La somme de toutes vos activités doit correspondre exactement à 24 heures.",
    "Start": "Commencer",
    "How many hours do you spend sleeping, resting lying down and napping per day?": "Combien d'heures passez-vous à dormir, à vous reposer allongé et à faire la sieste par jour ?",
    "How many hours do you spend in a sitting position such as eating, sewing, using the computer, working at the office, reading, writing, transporting, playing video games, watching TV": "Combien d'heures passez-vous en position assise, comme manger, coudre, utiliser l'ordinateur, travailler au bureau, lire, écrire, transporter, jouer à des jeux vidéo, regarder la télévision ?",
    "How many hours do you spend in a standing position such as shopping, washing, moving around the house or office, cooking?": "Combien d'heures passez-vous en position debout, comme faire les courses, faire la lessive, vous déplacer dans la maison ou au bureau, cuisiner ?",
    "How many hours do you spend doing moderate activities: manual work in a standing position: work in industry, machines, carpentry?": "Combien d'heures consacrez-vous à des activités modérées : travail manuel en position debout : travail dans l'industrie, les machines, la menuiserie ?",
    "How many hours do you spend doing construction work, gardening (digging), walking, car repair, masonry, and plasterwork?": "Combien d'heures passez-vous à faire des travaux de construction, du jardinage (creuser), de la marche, de la réparation automobile, de la maçonnerie et des travaux de plâtrerie ?",
    "How many hours do you spend in intense activity: sports, earthworks, agriculture, forestry?": "Combien d'heures consacrez-vous à une activité intense : sport, terrassement, agriculture, sylviculture ?",
    "How many hours do you spend doing a moderate activity such as: walking, gardening, yoga, gymnastics, house cleaning?": "Combien d'heures consacrez-vous à une activité modérée telle que : la marche, le jardinage, le yoga, la gymnastique, le ménage ?",
    "How many hours do you spend working out?": "Combien d'heures passez-vous à vous entraîner ?",
    "Send": "Envoyer",
    "Insert your body information": "Insérez vos informations corporelles",
    "weight": "poids",
    "Please insert your weight": "Veuillez insérer votre poids",
    "Use numbers and . only": "Utilisez des chiffres et . seulement",
    "Please insert a valid weight": "Veuillez insérer un poids valide",
    "Please insert your sex": "Veuillez insérer votre sexe",
    "sex": "Sexe",
    "Male": "Homme",
    "Female": "Femme",
    "age": "âge",
    "Please insert your age": "Veuillez insérer votre âge",
    "Please insert a valid age": "Veuillez insérer un âge valide",
    "height": "hauteur",
    "Please insert your height": "Veuillez insérer votre hauteur",
    "Please insert a valid height": "Veuillez insérer une hauteur valide",
    "Login to your account ": "Connectez-vous à votre compte ",
    "Username": "Nom d'utilisateur",
    "Password": "Mot de passe",
    "No account was found matching that username and password": "Aucun compte correspondant à ce nom d'utilisateur et à ce mot de passe n'a été trouvé",
    "Server unavailable right now , try at another time ": "Serveur indisponible pour le moment, essayez à un autre moment",
    "Login": "Se connecter",
    "Forgot your password ?": "Mot de passe oublié ?",
    "or": "ou",
    "Terms of Service": "Conditions d'utilisation",
    "and": "et",
    "Privacy Policy": "Politique de confidentialité",
    "Settings": "Paramètres",
    "Account": "Compte",
    "Allergies list": "Liste des allergies",
    "Physical Activity Evaluation": "Évaluation de l'activité physique",
    "Account info": "Informations de compte",
    "Edit": "Modifier",
    "Email address": "Adresse Email ",
    "Date of birth": "Date de naissance",
    "Change Password": "Changer le mot de passe",
    "Log out":"Se déconnecter",
    "Remove this plan ?" : "Supprimer ce plan ?",
    "By confirming this action this plan will definitely removed from your plan list ":"En confirmant cette action, ce plan sera définitivement supprimé de votre liste de plans",
    "Doing these activies : ":"Faire ces activités:",
    "Your have no favorite recipes yet ... ": "Vous n'avez pas encore de recettes préférées ... ",
    "Recipe":"Recette",
    "An error occurred, try again later": "Une erreur s'est produite, veuillez réessayer plus tard.",
    "This step has no video": "Cette étape n'a pas de vidéo",
    "Language": "Langue",
    "App Language": "Langue de l'application",
    "Selected app language": "Langue sélectionnée Français",
    "Content Language": "Langue du contenu",
    "recipeAlreadyExistsTitle": "existe déjà",
    "recipeAlreadyExistsContent": "La recette que vous essayez d'ajouter existe déjà dans le repas. Vous pouvez augmenter les portions à la place.",
    "okButton": "OK",
    "Invalid Username or Password": "Nom d'utilisateur ou mot de passe invalide",
    "PrivacyPolicyDescription":"Cette Politique de Confidentialité décrit comment vos informations personnelles sont collectées, utilisées et partagées lorsque vous utilisez l'application mobile Ukla.",
    "CollectionUsePersonalInfo":"Collecte et Utilisation des Informations Personnelles:",
    "CollectPersonalInfo":"Lorsque vous utilisez notre application, nous recueillons les informations personnelles que vous nous fournissez volontairement, telles que votre nom, votre prénom, votre adresse e-mail, votre sexe et votre âge. Nous utilisons ces informations pour créer et gérer votre compte sur notre application, ainsi que pour calculer vos besoins nutritionnels, y compris les calories, les protéines et d'autres éléments nutritifs, afin de vous fournir des recommandations personnalisées et une meilleure expérience utilisateur.",
    "SharePersonalInfo":"Partage des Informations Personnelles:",
    "ConfidentialInfo":"Nous ne partageons pas vos informations personnelles avec des tiers. Vos informations sont conservées de manière confidentielle et utilisées uniquement aux fins mentionnées ci-dessus.",
    "DataSecurity":"Sécurité des Données:",
    "DataSecurityDescription":"Nous prenons la sécurité de vos données personnelles très au sérieux. Toutes les transmissions de données entre votre appareil et nos serveurs sont cryptées. De plus, notre base de données offre des fonctionnalités de sécurité robustes pour protéger vos informations. Les mots de passe des utilisateurs sont également cryptés pour garantir une protection supplémentaire.",
    "UserRights":"Droits des Utilisateurs:",
    "UserRightsDescription": "Vous avez le droit d'accéder et de modifier les données personnelles stockées dans votre profil à tout moment. De plus, vous pouvez demander la suppression de votre compte, ce qui entraînera la suppression permanente de toutes vos données personnelles de nos systèmes.",
    "Contact us":"Contactez-nous :",
    "Contact usDescription": "Si vous avez des questions ou des préoccupations concernant notre politique de confidentialité, veuillez nous contacter à contact@uklanutrition.com",
    "PrivacyPolicy": "Cette politique de confidentialité est sujette à modification. Veuillez consulter régulièrement cette page pour toute mise à jour.",
    "PrivacyPolicyUpdate":"Cette politique de confidentialité a été mise à jour le 19/02/2024.",
    "or continue with":"ou continuer avec",
    "TermsOfServiceIntroduction": "Bienvenue sur Ukla, une application mobile de planification des repas. Les présentes conditions d'utilisation (ou « Conditions ») régissent votre utilisation de l'application Ukla. En créant un compte ou en utilisant Ukla, vous acceptez ces conditions.",
    "UserAccounts": "Comptes Utilisateurs",
    "UserAccountsDescription": "Pour utiliser l'application Ukla, vous devez être âgé d'au moins 13 ans ou avoir l'âge minimum légal requis dans votre pays. Vous devez vous inscrire en fournissant des informations exactes et à jour, y compris votre nom, prénom، adresse e-mail، sexe et âge. Vous êtes responsable de la sécurité de vos identifiants de connexion.",
    "AppFeatures": "Fonctionnalités de l'Application",
    "AppFeaturesDescription": "Ukla offre des fonctionnalités pour planifier vos repas, suivre vos besoins nutritionnels et recevoir des recommandations personnalisées. Nous ne vendons pas vos données personnelles, mais nous vous montrerons des publicités pertinentes basées sur vos intérêts et votre activité.",
    "UserContent": "Contenu Utilisateur",
    "UserContentDescription": "Vous êtes responsable du contenu que vous publiez ou partagez sur Ukla. Ukla se réserve le droit de supprimer ou de modifier tout contenu enfreignant nos politiques ou les lois en vigueur. Vous conservez la propriété de votre contenu, mais vous accordez à Ukla une licence mondiale non exclusive pour l'utiliser conformément à vos paramètres de confidentialité.",
    "SecurityPrivacy": "Sécurité et Confidentialité",
    "SecurityPrivacyDescription": "Ukla met en œuvre des mesures de sécurité pour protéger vos données personnelles. Cependant, vous devez prendre vos propres précautions pour sécuriser vos informations. Veuillez lire notre Politique de Confidentialité pour plus d'informations sur la manière dont nous collectons, utilisons et protégeons vos données.",
    "AdsRevenue": "Publicités et Revenu",
    "AdsRevenueDescription": "Ukla affiche des publicités de manière à soutenir l'application et à garantir sa gratuité pour les utilisateurs. Nous utilisons vos données pour vous présenter des publicités plus pertinentes.",
    "AppModifications": "Modifications de l'Application",
    "AppModificationsDescription": "Ukla se réserve le droit de modifier ou de mettre à jour ces conditions ou l'application à tout moment. En cas de changement majeur, nous vous informerons en temps opportun.",
    "Termination": "Résiliation",
    "TerminationDescription": "Vous pouvez désactiver ou supprimer votre compte à tout moment. Ukla peut résilier votre compte ou limiter votre accès en cas de violation de ces conditions.",
    "ObligationsRestrictions": "Obligations et Restrictions",
    "ObligationsRestrictionsDescription": "Vous ne devez pas utiliser Ukla à des fins illégales، frauduleuses ou nuisibles. Vous ne devez pas utiliser l'application pour transmettre du contenu illégal، inapproprié، offensant ou nuisible. Vous ne pouvez pas utiliser Ukla pour nuire à d'autres utilisateurs ou violer leurs droits. L'application est destinée à un usage personnel. Toute utilisation commerciale sans autorisation préalable est interdite.",
    "IntellectualProperty": "Propriété Intellectuelle",
    "IntellectualPropertyDescription": "Ukla respecte les droits de propriété intellectuelle et attend de ses utilisateurs qu'ils fassent de même. Vous ne pouvez pas utiliser la propriété intellectuelle d'Ukla sans autorisation.",
    "Conclusion": "Conclusion",
    "ConclusionDescription": "Ces conditions régissent votre utilisation de l'application Ukla. En cas de questions ou de désaccords، n'hésitez pas à nous contacter à contact@uklanutrition.com. Nous espérons que vous profiterez pleinement de votre expérience avec Ukla!",
    "TermsLastReviewed": "Date de révision: 19/02/2024",
    "password is required": "Le mot de passe est requis",
    "username is required": "Le nom d'utilisateur est requis",
    "An unexpected error occurred, try again later": "Une erreur inattendue s'est produite, veuillez réessayer plus tard",
    "Fat": "Gras",
    "Sugar": "Sucre",
    "Fiber": "Fibres",
    "Carbs": "Glucides",
    "Proteins": "Protéines",
    "Calories": "Calories",
    "g": "g",
    "We're working on the problem right away." : "Nous travaillons sur le problème immédiatement.",
    "Something went wrong!": "Quelque chose s'est mal passé!",
    "Please refresh app to continue planning.": "Veuillez rafraîchir l'application pour continuer à planifier.",
    "Refresh": "Rafraîchir",
    "First name": "Prénom",
    "Last name" : "Nom de famille",
    "Birth date": "Date de naissance",
    "Other" : "Autre",
    "username": "nom d'utilisateur",
    "Already have an account?": "Avez-vous déjà un compte?",
    "Create a new account": "Créer un nouveau compte",
    "Please insert firstname": "Veuillez insérer le prénom",
    "firstname should be at least 2 characters": "le prénom doit faire au moins 2 caractères",
    "Please insert lastname": "Veuillez insérer le nom",
    "lastname should be at least 2 characters": "le nom doit faire au moins 2 caractères",
    "Please insert birthdate": "Veuillez insérer la date de naissance",
    "Please insert your username": "Veuillez insérer votre nom d'utilisateur",
    "username should be at least 4 characters": "le nom d'utilisateur doit faire au moins 4 caractères",
    "Please insert your email": "Veuillez insérer votre email",
    "insert a valid email": "insérer un email valide",
    "Please insert password": "Veuillez insérer votre mot de passe",
    "Confirm password": "Confirmer le mot de passe",
    "Please confirm your password": "Veuillez confirmer votre mot de passe",
    "confirm password and password are different": "le mot de passe et la confirmation ne correspondent pas",
    "We are sending a verification code to your email address": "Nous envoyons un code de vérification à votre adresse email",
    "Success The user was created verify your email to be able to login": "Succès L'utilisateur a été créé vérifiez votre email pour pouvoir vous connecter",
    "The user was created verify your email to be able to login": "L'utilisateur a été créé vérifiez votre email pour pouvoir vous connecter",
    "Success": "Succès",
    "This username is already registered": "Ce nom d'utilisateur est déjà enregistré",
    "Please try to sign up using another username or log in if you already have an account.": "Veuillez essayer de vous inscrire avec un autre nom d'utilisateur ou de vous connecter si vous avez déjà un compte.",
    "This email is already registered": "Cette email est déjà enregistré",
    "Please try to sign up using another email or log in if you already have an account.": "Veuillez essayer de vous inscrire avec un autre email ou de vous connecter si vous avez déjà un compte.",
    "error occured please verify your internet connection": "une erreur est survenue veuillez vérifier votre connexion internet",
    "Sign Up": "Inscription",
    "email": "email",
    "Activation code": "Code d'activation",
    "Please type the activation code sent to your mail": "Veuillez taper le code d'activation envoyé à votre boîte mail",
    "Wrong code Try again": "Code incorrect Réessayez!",
    "email already confirmed": "email déjà confirmé!",
    "token expired": "token expiré",
    "Error occured": "Erreur survenue",
    "You have submitted a wrong code please verif your code.": "Vous avez soumis un mauvais code, veuillez vérifier votre code.",
    "confirm code": "confirmer le code",
    "Did not receive a code?": "N'avez-vous pas reçu de code?",
    "We are sending the mail to you...": "Nous vous envoyons l'e-mail...",
    "Resend": "Renvoyer",
    "title": "Erreur d'authentification",
    "message": "Il semble que vous êtes connecté sur un autre appareil.",
    "button": "Se reconnecter",
    "Connection timed out, please check your internet connection": "La connexion a expiré, veuillez vérifier votre connexion Internet",
    "failed to purchase": "échec de l'achat de ",
    "failed to unpurchase": "échec de l'annulation de l'achat de ",
    "failed to delete": "échec de la suppression de ",
    "failed to delete ingredients": "échec de la suppression des ingrédients",
    "No internet connection": "Pas de connexion Internet",
    "Ignore": "Ignorer",
    "Question" : "Question ",
    "For a better experience we’re going to ask you some questions": "Pour une meilleure expérience, nous allons vous poser quelques questions ",
    "left":"restant",
    "over":"de plus",
    "Sponsored": "Sponsorisé",
    "Modify username title": "Modifier le nom d'utilisateur",
    "Modify username text": "Veuillez entrer votre nouveau nom d'utilisateur",
    "Username changed successfully message": "Le nom d'utilisateur a été modifié avec succès",
    "You already have this username": "Vous avez déjà ce nom d'utilisateur",
    "Password verification title" : "Vérification du mot de passe",
    "Password verification text" : "Veuillez taper votre mot de passe actuel afin que nous puissions vérifier que vous êtes le propriétaire de ce compte",
    "Incorrect password": "Mot de passe incorrect",
    "Verify": "Vérifiez le mot de passe",
    "Modify Email title": "Modifier l'Email",
    "Modify Email text": "Veuillez taper votre nouvel e-mail, nous vous envoyerons un code de vérification",
    "Send code": "Envoyer le code",
    "New Password": "Nouveau mot de passe",
    "Confirm New Password": "Confirmer le nouveau mot de passe",
    "Password Changed Successfully": "Le mot de passe a été modifié avec succès",
    "Passwords doesn't match": "Les deux mots de passe ne sont pas les mêmes",
    "Please Fill All The Fields": "Veuillez remplir tous les champs",
    "Failed to delete the plan": "Échec de la suppression du plan, veuillez réessayer.",
    "please type your email , we'll send you a code verification": "Veuillez saisir votre email, nous vous enverrons un code de vérification",
    "Sending email...": "Envoi de l'email...",
    "this email doesn't exist !": "Cet email n'existe pas !",
    "Send mail": "Envoyer le mail",
    "Verification code": "Code de vérification",
    "Please type the verification code sent to your mail": "Veuillez saisir le code de vérification envoyé à votre email",
    "Wrong code! Try again !": "Code incorrect! Réessayez!",
    "wrong code !": "Code incorrect!",
    "Did not receive a code ?": "Vous n'avez pas reçu de code?",
    "Change your password": "Changez votre mot de passe",
    "enter your new password": "entrez votre nouveau mot de passe",
    "Please insert your new password": "Veuillez insérer votre nouveau mot de passe",
    "confirm your new password": "confirmez votre nouveau mot de passe",
    "Please confirm your new password": "Veuillez confirmer votre nouveau mot de passe",
    "updating the new password...": "mise à jour du nouveau mot de passe...",
    "Confirm password must be same as password": "Le mot de passe de confirmation doit être identique au mot de passe",
    "Reset Password": "Réinitialiser le mot de passe",
    "add_recipe":"Ajouter une recette",
    "no_video": "Aucune vidéo sélectionnée",
    "uploaded": "Téléchargé",
    "Title": "Titre",
    "Description": "Description",
    "Please insert recipe title": "Veuillez insérer le titre de la recette",
    "Please insert recipe description": "Veuillez insérer la description de la recette",
    "Recipe added Successfully !!": "Recette ajoutée avec succès !!",
    "Failed to add recipe": "Échec de l'ajout de la recette",
    "Shop list": "Liste de courses",
    "Profile": "Profil",
    "This interface is temporary and under development": "Cette interface est temporaire et en cours de développement.",
    "We are working hard to implement the complete Add Recipe feature. Please bear with us while we make these improvements": "Nous travaillons dur pour mettre en œuvre la fonctionnalité complète d'ajout de recette. Veuillez patienter avec nous pendant que nous apportons ces améliorations.",
    "Recipe title": "Titre de la recette",
    "Mediterranean Lemon Herb Chicken": "Poulet aux herbes et citron méditerranéen",
    "Steps": "Étape 1 : citron 1 moyen, sel 2 cuillères à soupe\nÉtape 2 : poulet 500g, eau 1L",
    "My recipes": "Mes recettes",
    "Failed to delete": "Échec de la suppression",
    "deleted successfully": "supprimé avec succès !!",
    "Recipe added succ": "Recette ajoutée avec succès !!",
    "Created recipes": "Recettes créées",
    "recipes": " recettes",
    "No recipes found yet, add one...": "Aucune recette trouvée pour le moment, ajoutez-en une...",
    "Update Recipe": "Mettre à jour la recette",
    "updated successfully": "mis à jour avec succès",
    "added successfully": "ajouté avec succès",
    "Searching...": "Recherche en cours...",
    "Valid username":"Nom d'utilisateur valide",
    "Invalid username":"Nom d'utilisateur non valide"
}